//---------------------------------------------------------------------------===||Задача 1||===--------------------------------------------------------------------------\\
let login;
let password;
let loginSecond;
let passwordSecond;
let mail;
do {
    login = prompt("Введите логин для входа в личный кабинет");
    password = prompt("Введите пароль для входа в личный кабинет");
    loginSecond;
    passwordSecond;
    do {
        loginSecond = prompt("Повторите логин для входа в личный кабинет")
        passwordSecond = prompt("Повторите пароль для входа в личный кабинет")
    } while(!(loginSecond==login && passwordSecond==password))
    mail = prompt("Введите адрес электронной почты для завершения регистрации");
} while(!alert(`Ваши данные:\nЛогин: ${login}\nПароль: ${password}\nЭлектронная почта: ${mail}\nДля подтверждения нажмите "OK"\nДля повторного ввода нажмите "Отмена"`))
alert("Для завершения регистрации проверьте свою почту")
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------//




//------------------------------------------------------===||Задача 2||===--------------------------------------------------\\
alert("Игра “Чёт или нечет” - правила просты,\nкомпьютер загадывает число от 1 до 100, а мы отгадываем чётное оно или нет.")
do {
    let winScore = Number(prompt("Выберите число очков для победы(1-100)"))
    let score;
    do {
        let randomNumber = Math.floor(Math.random() * 100 + 1)
        let userAnswer = prompt("Чёт или нечет?")
        if (userAnswer == "Чёт") {
            if (randomNumber%2==0) {
                alert("Верно!\n+1 к счёту")
                score++;
            } else {
                alert("Неверно!")
            }
        } else if (userAnswer == "Нечет") {
            if (randomNumber%2!=0) {
                alert("Верно!\n+1 к счёту")
                score++;
            } else {
                alert("Неверно!")
            }
        }
    } while(score!=winScore)
} while(confirm("Ещё разок?"))
//--------------------------------------------------------------------------------------------------------------------------//




//--------------------------------------------------------------------------------------------------------===||Задача 3||===--------------------------------------------------------------------------------------------\\
alert("Игра 'Заполни ящики'\nЦель игры заполнить ящики содержимым конфет до значения 400 единиц.\nКаждый раунд в ящики добавляется случайное кол-во конфет от 0 до 100.\nВсего 3 раунда\nВаша задача досыпать конфеты.")
do {
    let box1 = Math.floor(Math.random() * 100 + 1);
    let box2 = Math.floor(Math.random() * 100 + 1);
    let box3 = Math.floor(Math.random() * 100 + 1);
    for(let part = 1; part <= 3; part++) {
        alert(`В ящики добавлена ${part}-я партия конфет\nСодержимое ящиков:\nЯщик 1: ${box1}\nЯщик 2: ${box2}\nЯщик 3: ${box3}`)
        let doAdd = confirm("Будем досыпать?")
        if (doAdd) {
            let boxIndex = Number(confirm("Введите номер ящикa"))
            if (boxIndex==1) {
                box1 = box1 + Number(confirm("Сколько будем досыпать?"))
            } else if (boxIndex==2) {
                box2 = box2 + Number(confirm("Сколько будем досыпать?"))
            } else if (boxIndex==3) {
                box3 = box3 + Number(confirm("Сколько будем досыпать?"))
            }
        }
        box1 = box1 + Math.floor(Math.random() * 100 + 1);
        box2 = box2 + Math.floor(Math.random() * 100 + 1);
        box3 = box3 + Math.floor(Math.random() * 100 + 1);
    }
    alert(`Результат:\nЯщик 1:${box1}\nЯщик 2:${box2}\nЯщик 3:${box3}`)
    if (box1, box2, box3 == 400) {
        alert("Вы победили!")
    } else if (box1 != 400) {
        alert("Cодержимое ящика 1 неверно!")
    } else if (box2 != 400) {
        alert("Cодержимое ящика 2 неверно!")
    } else if (box3 != 400) {
        alert("Cодержимое ящика 3 неверно!")
    }   
} while(confirm("Ещё раз?"))
//----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------//