//-----------===Задача 1===--------\\
const part1 = "Я";
const part2 = "знаю";
const part3 = "JavaScript";
console.log(part1,part2,part3);
//------------------------------------------------//



//-------------------------===Задача 2===----------------------\\
const width = 5;
const height = 13;
console.log(`Периметер: ${(width+height)*2}`)
console.log(`Площадь: ${width*height}`)
//---------------------------------------------------------------------------//



//-----------===Задача 3===--------\\
let playerHealth = 73
console.log(playerHealth>0)
//-----------------------------------------------//



//----------------------===Задача 4===-------------------\\
let temperature = 13
if (temperature>=17 && temperature<=25) {
    console.log("Тепло, можно без шапки")
} else if(temperature>25) {
    console.log("Жарко, одень кепку")
} else {
    console.log("Холодно, одень шапку")
}
//-------------------------------------- ------------------------------//



//--------------===Задача 5===-----------\\
let number = 8;
if (number % 2 == 0) {
  console.log("Число четное");
} else {
  console.log("Число не четное");
}
//-----------------------------------------------------//



//---------------------------------------===Задача 6===------------------------------------\\
let UriySpeed = 24
let UriyDistance = 136
let SvetlanaSpeed = 22
let SvetlanaDistance = 124
if (UriyDistance/UriySpeed < SvetlanaDistance/SvetlanaSpeed) {
    console.log("Победитель: Юрий")
} else {
    console.log("Победитель: Светлана")
}
//-------------------------------------------------------------------------------------------------------//



//--------------------------------------------------------===Задача 7===-----------------------------------------------------\\
let month = "ноябрь"
if (month == "сентябрь" || month == "октябрь" || month == "ноябрь") {
    console.log("С деревьев опали листья")
} else if (month == "декабрь" || month == "январь" || month == "февраль") {
	console.log("Снегопад засыпал крыши домов")
} else if (month == "март" || month == "апрель" || month == "май") {
	console.log("Расцветали цветочки и пели птички")
} else if (month == "июнь" || month == "июль" || month == "август") {
	console.log("Было жарко и грело солнце")
} else {
	console.log("Неверный ввод! (Писать нужно с маленькой буквы на русском)")
}
//-----------------------------------------------------------------------------------------------------------------------------------------//



//--------------------------------===Задача 8===-----------------------------\\
let number1 = 4
let number2 = 6
let number3 = 8
let number4 = 10
let operation;
if (number1>number2) {
	if (number1-number2>number3) {
		operation = (number1-number2)-number3
	} else {
		operation = number3-(number1-number2)
	}
} else {
	if (number2-number1>number3) {
		operation = (number2-number1)-number3
	} else {
		operation = number3-(number2-number1)
	}
}
console.log(operation%number4==0 ? "Числа кратны")
//------------------------------------------------------------------------------------------//